src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorDispersion/0.pbe/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.128";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
1000
(
(0.301998 0.095922 6.58417e-18)
(0.226692 0.0106287 6.2643e-18)
(0.155487 0.0003751 1.49625e-18)
(0.152943 0.000266168 -4.08804e-19)
(0.148902 -3.51514e-05 3.2775e-21)
(0.149531 2.40466e-05 -1.15757e-18)
(0.149121 -1.12791e-05 -2.22276e-21)
(0.149297 4.067e-06 1.524e-18)
...
)
;

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
