src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorDispersion/0.pbe/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      rhoPhi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1930
(
0.0154736
0.0372764
0.00927878
0.00619475
0.00823799
0.00104079
0.00791102
0.00032696
...
)
;

boundaryField
{
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform -0.05275;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
0.00786897
0.0220427
0.034642
0.0456648
0.0551128
0.0629859
0.0692845
0.0740084
0.0771576
0.0787322
0.0787322
0.0771576
0.0740084
0.0692845
0.0629859
0.0551128
0.0456648
0.034642
0.0220427
0.00786897
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
